{
  "beginner": {
    "beginners guide": {
      "details": "Walkthrough for how to optimally start in AFK Journey.",
      "content": ":::guide-title\nBeginner's Guide\n:::\n\n:::toc\n# Contents\n\n* [Preface](#preface)\n* [First 24 Hours](#first-24-hours)\n* [Wishlist](#wishlist)\n* [Battle](#battle)\n* [AFK Stages](#afk-stages)\n* [Gear Priority](#gear-priority)\n* [Leveling Strategies](#leveling-strategies)\n* [Story & Campaign](#story--campaign)\n* [Dream Realm](#dream-realm)\n* [Arena](#arena)\n* [Guilds & Cooperative Play](#guilds--cooperative-play)\n* [Additional Battle Modes](#additional-battle-modes)\n* [Stores & Currencies](#stores--currencies)\n* [Affinity](#affinity)\n* [Looking Ahead/Midgame Considerations](#looking-aheadmidgame-considerations)\n* [Spending Pitfalls & Optimizations](#spending-pitfalls--optimizations)\n:::\n\n:::::two-column\n::::column\n![Image](https://i.imgur.com/9UIUCsW.png)\n::::\n::::column\n# Preface\nHey there! I'm inSeas0n, and I'm passionate about helping AFK Journey players like you achieve greatness. With my data-driven guides, meticulously crafted tier lists, and a vibrant community, you'll have all the tools you need to conquer Esperia.\n\nWhether you're a beginner looking for a solid foundation or a seasoned veteran seeking an edge, my content is designed to empower you to make informed decisions and optimize your gameplay.\n\nJoin our thriving community on Discord, where you can connect with fellow players, discuss strategies, and get personalized advice. I'm also active on [Social Media Links], where I share the latest updates, tips, and behind-the-scenes insights. Let's embark on this AFK Arena journey together! ⚔️\n\n::space\nHey there! I'm 'Seas0n' founder of Analytica and writer of this beginners guide. I have 4 years experience with [AFK Arena](https://afkarena.lilith.com/), & 1 year experience with [AFK Journey](https://afkjourney.farlightgames.com/) (PTR1) and [Dislyte](https://dislyte.farlightgames.com/). I've seen Journey Alpha, Beta (PTR, Sail, Voyage) and every iteration of the game that eventually turned into the version we play today. \n\nI am **GM** of '**Analytica**' [S1] and all subsidiary guilds **[Analytica.S, Analytica.X, Analytica.Y, Analytica.Z, Analytica.V, Neverlytica, Wonderlytica, Analytica.EX]** This is all to say that I have an extensive history with Lilith Game Mechanics and have tons of in-game experience to get you the start you need!\n:::centered-text\n## Got a question? [Analytica Discord](https://discord.gg/analytica)\n:::\n:::centered-text\n###### \\*come harass Seas0n & L3gacy*\n:::\n::::\n:::::\n\n# First 24 Hours\n::::two-column\n:::column\n![Image](https://i.imgur.com/I3N0gQU.png)\n:::\n:::column\n**First 24 hours**\n* Ditch Chippy & Hammie\n* Use Diamonds on 10x 'All-Hero Recruitment' (AHR) [2700 Diamonds]. \n  * You never stop summoning from 'All-Hero Recruitment' (AHR) so start early and often.\n* Push to AFK Stage 16, in 'Holistone' (main city) and proceed to the '2nd Chapter Stage'.\n* Buy and use Arena tickets - Rank-up gives Diamonds early.\n::space\n**Settings**\n* Ultimate Animations | Settings → Battle → Play Ultimate Animation: Never \n* Manual Toggle | Settings → Battle → Auto Battle Settings: ‘Optional per Battle’\n* Smooth Graphics | Settings → Graphics → Graphics Quality: 'Smooth'\n* Quest Squad | Settings → Settings → Enable Quest Squad: 'Off'\n* During Battle, in the bottom right corner - Enable '2x' and 'Auto' Ultimate.\n:::\n::::\n\n# Wishlist\nBy this point you should have enough invites to unlock the 'Wishlist'. Before recruiting any further, make sure to look through our dedicated Wishlist guide to ensure you pull heroes important for early game progression, this is critical to begin snowballing your account day 1. Beyond hero selection there are a few other things to note about recruiting:\n\n::space\n* When buying Invite Letters with Diamonds, always buy them to Recruit 10 heroes at a time, as you will get a 10% discount\n* Diamonds are used almost exclusively in Hero Recruitment so besides keeping a reserve of ~500 Diamonds day to day, spend them all on hero pulls\n* Every day, make sure to buy the daily 30% discounted Invite Letter in the Guild Store in the Emporium, but do not buy the discounted Faction Acorns\n:::centered-text\nNow it's time to enter your Codes and pull a bunch of heroes!\n:::\n\n::space\n# Battle\n:::::two-column\n::::column\nFor an in-depth guide, be sure to read through our [Battle Mechanics](https://www.afkanalytica.com/journey/mechanics/battle) page to understand the strategic elements of battle before making too many early-game decisions. The effects of background mechanics like faction advantage and class stat growth can have a huge effect on whether you are able to push through a difficult stage or story battle early in the game.\n:::centered-content\n[![Image](https://i.imgur.com/85OZPUL.png)](https://atek.afkanalytica.com/formations/25)\n:::\n::::\n::::column\n:::centered-content\n[![Image](https://i.imgur.com/BbUj73Y.png)](https://atek.afkanalytica.com/formations/26)\n:::\nBeyond this, for beginners, the most important thing to know when kicking off day 1 is to focus on starting battles with a winning hand. Meaning, rather than spending a lot of time trying to micromanage individual battles through formation or artifact choice, always go into battle playing a strong team composition and having optimized your Equipment and Hero Resonance level as detailed later in this guide.\n::::\n:::::\n\n::space\n# AFK Stages\nAFK Stages constitute the #1 benchmark of account progression. They not only dictate the passive rewards your account continuously accrues, but they unlock all additional battle modes as well as story chapters via miasma gates. From the moment they are unlocked until you point when you become walled by hero power at a difficult stage, they are the main focus of logging in each day (during early game), and in a sense, all other account progression is valuable insofar as they can push you through additional Stages.\n::::centered-content\n:::sm-img\n![Image](https://i.imgur.com/njp5WHk.png)\n:::\n::::\n## Fast Rewards\nAs you near the end of each day, be sure to use your 'Instant AFK Attempts' (Fast Rewards). Since the Fast Rewards yield dust based on your Stage progression (by giving you the equivalent of 2 hours of your AFK passive rewards), it is always advisable to wait until you are either walled by a tough stage, or are about to log off for the day to cash them in, maximizing the dust it will provide. Each day you will be granted a free Fast Reward, as well as an opportunity to buy a Fast Reward with 50 diamonds. Do not forget to cash these in, as they are one of the only consistent daily sources of dust and require no time investment to earn.\n\n## Reward Unlocks\nAs you progress later into the game you will unlock additional Fast Rewards at two critical points, which should be optimized to be reached as soon as physically possible. Since Fast Rewards yield dust at minimum 2 times each day, the compounding effect of this dust over weeks and weeks cannot be underestimated, and unlocking even a single additional attempt is huge.\n* First for f2p: a second free Fast Reward each day, unlocked by claiming 100 daily quest rewards. \n  * For this reason it is extremely important to complete the max of 5 daily quests each day, so that you start day 21 with +2 Free Fast Rewards.\n* Second for f2p: a second paid Fast Reward each day for 100 Diamonds. Unlocked by reaching VIP Level 3 from earning 230 Mithril points.\n  * Given to all players at Resonance Level 160 via the Growth Path Quest\n  * Although f2p players will unlock this after their second free Fast Reward, those who choose to follow the advice given below in our Early Game Spending Section, and purchase the Noble Path Bundle day 1, will unlock this immediately, and the additional dust from this will begin to compound right away, further snowballing their first-week progression.\n::::centered-content\n:::xs-img\n![Image](https://i.imgur.com/tLHDqLd.png)\n:::\n::::\n\n# Gear Priority\n::::centered-content\n:::xl-img\n![Image](https://i.imgur.com/hQIhg6G.png)\n:::\n::::\n\n# Leveling Strategies\n## The '+5 Level-Gap (5LG)'\nUpon starting the game or beginning a new season, all players will follow roughly the same leveling strategy - a +5 level resonance gap strategy. Upon entering a new bracket of 10 levels (i.e. 11-21 or 21-31), first spend your banked resources only on your main carry hero until they are at the +5 position in the bracket (i.e. 15 or 25). Then level your other 4 heroes evenly until they meet your main carry at +5, unlocking the next equipment level for your party.\n\nOnce the equipment level has been reached, again push your main carry to the next threshold at the +11 position of the bracket (i.e. 21 or 31) in order to unlock their new hero skill or skill upgrade. Finally, level your remaining heroes evenly until they too complete the bracket and unlock their new skill.\n\n:::centered-text\n## +1 → +5 → +11\n:::\n\nFor example, suppose your party consists of Cecia as your main carry, supported by Smokey, Rowan, Koko and Brutus, and you've just reached resonance level 31. You will first spend resources to get Cecia to level 35, then level the rest of your party evenly until they reach level 35 and get the equipment level. Then, if you have resources left over you will apply the same strategy to reach level 41, 45, 51 and so on, raising Cecia first then pushing your party evenly to follow.\n\n::::centered-content\n:::xs-img\n![Image](https://i.imgur.com/MLPK8j7.png)\n::::\n\n## Leveling In Midgame: Dust Capping\nIn early game (week 1) you will generally find that it is EXP that's capping you on leveling (i.e. is the resource in scarcity). However, once the initial joining bonuses of dust have been earned, you will spend the remainder of the game/season dust capped. Thus, the only caveat of the +5 level gap strategy is that when players eventually become scarce on dust, they will be unable to consistently push past the +10 position (e.g. level 40) dust wall with one or more heroes. \n\nBecause of this, you'll get used to having enough dust each day to push only 1 or 2 heroes into the next level bracket, and need to wait for additional rewards for the others to follow. While you're waiting, no longer being scarce on EXP, spend all of your available EXP on heroes who can accept it, creating up to a +10 level gap between party members on either side of the dust wall.\n\n:::::two-column\n::::column\n## Ascension\nAs you progress through the game and recruit more and more heroes, you will start to acquire multiple copies of heroes on your wishlist. This will unlock the opportunity to ascend them to higher levels for better stats, and starting at Legendary+, additional skills.\n### Ascension Tiers Requiring Acorns:\n* 'A-Tier': 200 acorns [Supreme]\n* 'S-Tier': 350 acorns [50x Legendary, 100x Mythic, 200x Supreme]\n### Ascension Skill Unlocks:\n* Legendary+: Hero Focus\n* Mythic+: Skill 3 & EX Skill [+10]\n* Supreme: EX Skill [+15]\n* Supreme+: Enhance Force & EX Skill [+20]\n### Hero Focus Overview\nHero Focus is an ability that unlocks after a hero reaches Legendary+ ascension. This ability is not a skill that is cast, but rather a passive enhancement that provides an additional bonus effect or stat boost to the hero.  The effects of Hero Focus vary from hero to hero, and in some cases can synergize with a hero's existing skills to enhance their effectiveness. For example, Reinier's Hero Focus increases the effectiveness of his Dynamic Balance skill. In other cases, Hero Focus acts as a simple stat boost, such as increasing a hero's Attack, Crit, or Haste.\n::::\n::::column\n:::centered-content\n![Image](https://i.imgur.com/6WSsp5I.png)\n:::\n::::\n:::::\n\n# Story & Campaign\nIn the beginning of the game the main story should be focused only insofar as it unlocks access to the AFK Stages. Otherwise it is your primary directive to push Stages. Since all Battle Modes are unlocked by reaching AFK Stage milestones - early game campaign should always be a secondary priority to maximizing Stage progression.\n\nThat being said, campaign is a major source of dust accumulation, and is important for total progression. After completing as many AFK Stages as possible, you should advance the main quest through as many Miasma gates as you can. While progressing through the story these are the main campaign rewards needed to continue snowballing your account progression: \n\n1. Main Story Quest: Dust, Diamonds, Gear, Artifact Materials\n2. Growth Path Quests: Epic Invites, Soulstones, Diamonds, Overleveled Gear\n3. Corrupted Creatures: Dust, Soulstones, Overleveled Gear, Artifact Materials\n4. Town Side Quests: Dust, Soulstones (Purple Quests - track using Quest Panel below world map)\n5. Crimson Loot Chests: Epic Invites, Dust, Diamonds, Overleveled Gear\n6. Puzzle Medium Chests: Dust, Diamonds, Gear Materials\n\nBeyond earning the main campaign rewards, extraneous and time intensive content should be avoided in order to speed run your account to maximum progression. Obviously for immersion’s sake it is worth slowing down and enjoying the game rather than simply treating it as a race to the finish, but especially day 1, the payoff for a speed-running mentality is huge.\n\nThe first milestone on miasma gate advancement is unlocking access to Dark Forest 5, and the first Primal Lord - World Boss. Primal Lords, being time sensitive, are very important to reach before they are killed. Using all of your attacks each day the boss is active gives large amounts of dust and EXP, and provides a huge bonus to account progression that players too late to the required chapter will miss out on. Because of this, reaching the Lone Gaze at Dark Forest 5 should be a week 1 priority so that it can be attacked the day it opens.\n\nIn general the mentality for day 1 is to push as hard as possible when first starting the game in order to lock in significant idle rewards. So then you can kick back and collect idle rewards passively, progressing at your own pace.\n\n::::centered-content\n:::sm-img\n![Image](https://i.imgur.com/pimNnjS.png)\n:::\n::::\n\nLater, having completed the major campaign related account progression, in your free time after using all of your daily attempts on each Battle Mode, go into your quest panel (below the world map) and do side quests, marked in blue. Once all of these rewards have been claimed, go back through the campaign and find the small chests and kill the world enemies.\n\n# Dream Realm\nAs the first additional Battle Mode unlocked (AFK Stage 16), Dream Realm is a central part of your daily rewards checklist. You should be using your maximum number of attacks each day in order to optimize your comp to deal the most damage. The unique Dream Fragment reward currency is used in the emporium to directly purchase copies of any epic hero, and thus provides early game access to ascension for high value epic heroes such as Odie, who you should be using all of your dream currency to rush to Legendary and Mythic tier as soon as possible.\n\nIn addition, the weapon gear pieces granted at 40% & 60% boss completion can be rated up to 60 levels higher than your max equipment level, and provide massive bonuses to hero power, especially in the beginning of the game. Even getting one of these early on can get you a level 100 weapon for your main carry, which will assist immensely in your early AFK Stage progression.\n\nAs the bosses cycle daily through each of the 4 available, the payoff for getting decent damage progression on each one in your first week will contribute to snowballing your account through the early game with minimal effort. As the power of your team grows you will eventually kill the first iteration of each boss and advance to the next difficulty, where the boss’ stats increase and the rewards reset. It is worth mentioning however, that although you should use all of your attempts to kill the boss each day, consider saving several for the end of the day, so that any major progression you gain through daily rewards can be used to get a few more % points towards boss damage, potentially pushing you into the next rewards bracket. However, if you forget, you can always purchase extra boss attacks with gold, at a reasonable price.\n\n::::centered-content\n:::md-img\n![Image](https://i.imgur.com/XcfTfGO.png)\n:::\n::::\n:::centered-text\n#### For a detailed explanation of boss strategies, refer to our [Dream Realm Guide](https://www.afkanalytica.com/journey/dream-realm)\n:::\n\n# Arena\nUnlocked after AFK Stage 20, Arena is the third Battle Mode critically important for new players. The 800-900 Diamonds awarded by advancing into each additional tier is huge early game, and with a solid comp is extremely easy to achieve. Especially at the beginning of each new server or season, you will often find opponents listed simply as 'Challenger'. These are computer players generated by the game to fill rank slots when there are not enough players to attack. Always attack 'Challenger' players as their hero power will be drastically lower than the rest of the available options. Because of this, and the relative ease of advancing tiers early game it is reasonable to intend and expect to win every battle. Arena itself is broken up into two portions, attacking and defending.\n\n## Attacking\nThe majority of your time in Arena will be spent choosing which players to attack ('Challenge') to gain ranking points towards your next tier. You begin each day with 5 Challenge attempts and, in addition to ranking points upon winning, are awarded 500 Arena Coins for every 5 attacks you complete, up to the maximum of 20 each week. It is critical you do all 20 attacks each week to get full rewards.\n\nArena Coins are the only currency that can be used to directly purchase copies of S-Tier Heroes, and are invaluable for early game ascension of Elite heroes to Legendary and Mythic. In addition to the daily Challenges, the ranking you hold at the end of each day will grant you additional rewards of Arena Coins through the mail, as well as weekly rewards at the beginning of each week. For this reason, Arena ranking should be viewed as the second main source of passive rewards aside from AFK Stage progression, and should be maximized as quickly as possible by new players.\n\nUpon beginning an attack, you will first be displayed a list of other players to target, 3 at a time. This is the most important part of each attack, and choosing the player with the lowest power is the #1 factor to influence your win chances. Because of this, be sure to use several of your refresh attempts, and take your time in evaluating the average power of other players in your tier so that you can choose one at the relative minimum of your range.\n\nOnce in the battle, treat it as you would any other, and be sure to take into consideration the strategic factors discussed in our [Battle Guide](https://www.afkanalytica.com/journey/mechanics/battle) such as Faction Advantage and using the right artifact. For PvP it is generally recommended to use the [Confining Spell](https://www.afkanalytica.com/journey/mechanics/artifacts), as the crowd control effect of its 'Imprisoning' stops healing and interrupts energy generation by backline DPS heroes.\n\n::::centered-content\n:::sm-img\n![Image](https://i.imgur.com/AwGUMpw.png)\n:::\n::::\n\n## Defending\nAfter using all your Challenge attempts (and purchasing additional with Diamonds if so chosen), make sure to assign your defensive Formation for when other players attack you. Otherwise you will come back to do your next round of Arena attempts and find that you may have dropped into the previous tier from losing defenses.\n\nAlthough there are 5 total maps for Arena battles, you only have the option to select a single formation to be applied to all of them. So take a few minutes to select a formation that fits your hero comp well on the base map, and then go through each of the other maps to see how it is modified for each of their tilesets. Take note of Map 5 especially, as balancing your formation between maps 1 and 5 is a good measure of how effectively it will defend you on average from incoming attacks.\n\n# Guilds & Cooperative Play\nAfter locking in your AFK Stage Rewards, and ranking in Dream Realm and Arena, the final means of generating passive rewards is by joining a well ranked Guild. Most guild will have an application process, during which your hero power and account activeness will be assessed, and for the average non-competitively focused player, it is recommended to join any one of the top 20-30 guilds on your server.\n\n## Guild Rewards\n* Access to Guild Quest Rewards (Weekly)\n  * Up to 2500-7000 Guild Medals/Week\n* Access to Purchasing Premium Items in the Guild Store (Monthly)\n  * Epic Invite Letters (+1 per Guild Level, up to 6/month) - 400 Diamonds\n  * Stargazing Crystals (Total of 6/month) - 400 Diamonds\n* Guild Chest Rewards (Weekly)\n* Glory Expedition Rewards (Seasonal)\n  * 2000-5000 Diamonds\n  * 5000-12,000 Guild Medals\n\n::space\nJust being in a Guild allows you to start claiming Guild Quest Rewards. However, your Guild Level will dictate your maximum weekly number of Guild Medals claimable through these, as well as the number of Epic Invite Letters you may purchase in the Guild Store. Additionally, your Guild's ranking on the various Battle Modes and performance in Battle Drill will determine how much you receive from weekly Guild Chests and seasonal Glory Expeditions.\n\n## Battle Drill (AFK Stage 50)\nBattle Drill constitutes your first and only major Guild responsibility. It is a competitive Battle Mode in which you will work as a Guild to capture a series of enemy strongholds and defeat a Boss, and your performance will be ranked against other Guilds. Participating in this mode will earn you Guild Loot Chests and EXP from defeating enemies, and killing the Boss will award Diamonds. Read our intro to [Battle Drill](https://www.afkanalytica.com/journey/battle-drill) for an overview of the mode, as well as our Seasonal Guides for specific advice on strategy for the various maps.\n\n## Guild Quests & Challenges\nOther than Battle Drill, you contribute to your Guild by completing Guild Quests and Guild Challenges. Guild Quests are player-specific and are claimed for Guild Medals as part of your daily rewards. Each one you complete contributes 1 Activeness to your personal ranking within your Guild, and 1 XP towards your Guild's next level. Therefore, Guilds generally will kick players that do not maintain a minimum amount of Activeness each week.\n\nGuild Challenges, however, are not completed until 1/3 or 1/2 of the members of a Guild have reached a certain milestone in the game, and award a large amount of Medals to the entire Guild. They range from completing a chapter of the story, to reaching a certain level in each Battle Mode, to completing a certain number of AFK Stages, and add an additional element of pressure for all Guild members to maintain account progression.\n\n# Additional Battle Modes\n## Honor Duel (AFK Stage 16)\nHonor Duel is relatively unimportant for early players. Yielding only Diamonds, Gold and Invite Letters, it has no effect on early game dust-based growth. Therefore, it should be viewed only as a means of Diamond acquisition if players have leftover time to play after finishing their main goals. Although a total of 700 Diamonds and 2 Invite Letters are awarded from achieving 15 total victories, the mode is relatively time intensive, and it will take players at minimum 2 full rounds (lasting approximately 30 minutes each) to earn all of these rewards. For this reason, it is recommended for players to play one round every day or two so that all rewards can be earned in a timely manner before they reset at the end of the week.\n\nMore in-depth information on strategy and mechanics can be found on our [Honor Duel](https://www.afkanalytica.com/journey/honor-duel) page.\n\n## Arcane Labyrinth (AFK Stage 100)\nArcane Labyrinth is a dungeon crawl mode where players attempt to clear 15 stages of battles of increasing difficulty, ending in a Boss. After each stage you will receive access to buffs in the form of Relics, and Pure Crystals, a currency to be spent at a between-stage store. It is important to note that hero health is not replenished between stages, and heroes that die in the course of a battle can only be revived by using special purchasable items. So choosing the right buffs to build a cohesive strategy for the later levels is necessary to avoid your first string party members dying off, and having to resort to substitutes.\n\nThe Labyrinth has 15 difficulties in total, and clearing each one for the first time awards the player 3 Epic Invite Letters, although the first 3 difficulties also provide 200, 400 and 600 dust, making completing these early game a big priority. Also after completing a difficulty you may choose to continue through an additional 5 floors of Deep Labyrinth to gain Glory Points.\n\n## Legend Trials (Towers) (AFK Stage 166)\nLegend Trials are somewhat of a blend between AFK Stages and Campaign, and are important for dust acquisition. Every 10 floors of completion for each faction awards dust, and is designed so that you can complete approximately 10 floors each week with standard leveling, and you should make this your goal. Between each interval of 10 floors you will also get acorns, invite letters and blue gems. If you are unable to push all factions through 10 floors by the end of the week, be sure to utilize the weekend to catch up those that are lagging behind. On Friday and Saturday two factions towers will be available, and on Sunday all four will be open.\n\n# Stores & Currencies\n## Store #1: Emporium\n:::::::two-column\n::::::two-column\n:::::column\n::::centered-content\n:::xxs-img\n![Image](https://i.imgur.com/YzDJYiY.png)\n:::\n::::\n::::centered-text\n### Recruitment Store\n::::\n:::::\n:::::column\n**Currency:** Dolly Tickets\\\n**Earned By:** Recruiting Heroes\\\n**Spend On:** All Available Stargazing Crystals or 50% Off Epic Invites\n:::::\n::::::\n::::::two-column\n:::::column\n::::centered-content\n:::xxs-img\n![Image](https://i.imgur.com/31CYFEH.png)\n:::\n::::\n::::centered-text\n### Guild Store\n::::\n:::::\n:::::column\n**Currency:** Guild Medals\\\n**Earned By:**\n* Guild Quests, Chests, & Challenges\n* Glory Expedition\n\n**Spend On:** Hypogean or Celestial Hero Soulstone\\\n**Also Buy With Diamonds:**\n* Daily: Discount Invite Letter\n* Monthly: Epic Invite Letters, Stargazing Crystal\n:::::\n::::::\n:::::::\n\n:::::::two-column\n::::::two-column\n:::::column\n::::centered-content\n:::xxs-img\n![Image](https://i.imgur.com/6fV9m8r.png)\n:::\n::::\n::::centered-text\n### Arena Store\n::::\n:::::\n:::::column\n**Currency:** Arena Coins\\\n**Earned By:**\n* Arena Daily Wins (500x) [5/10/15/20 wins]\n* Arena & Supreme Arena End-of-Day & Weekly Rank\n\n**Spend On:** Cecia > Granny > Hewynn > Cassadee\n:::::\n::::::\n::::::two-column\n:::::column\n::::centered-content\n:::xxs-img\n![Image](https://i.imgur.com/HHH0V2Q.png)\n:::\n::::\n::::centered-text\n### Dream Store\n::::\n:::::\n:::::column\n**Currency:** Dream Fragments\\\n**Earned By:** Dream Realm Boss Damage & Rankings\n\n**Spend On:** Odie > Marilee > Kokko > Korin \n:::::\n::::::\n:::::::\n\n:::::::two-column\n::::::two-column\n:::::column\n::::centered-content\n:::xxs-img\n![Image](https://i.imgur.com/j9mLGhL.png)\n:::\n::::\n::::centered-text\n### Friendship Store\n::::\n:::::\n:::::column\n**Currency:** Pal-Coins\\\n**Earned By:** Send & Receive Favor From Friends\\\n**Spend On:** Daily 20% Off Affinity Item\n:::::\n::::::\n::::::column\n### On Friends List Optimization\nYou will start the game with an empty friends list. Besides directly adding your friends, be sure to use your 3 suggestions each day to max your list and more easily get all your send & receives every day. This translates to additional hero Affinity gifts down the line.\n::::::\n:::::::\n\n:::::two-column\n::::column\n## Store #2: Forge\n:::xs-img\n![Image](https://i.imgur.com/goHjhSk.png)\n:::\n**Currency:** Gold\\\n**Spend On:** Overleveled Gear\\\n**Notes:** Forge gear is extremely expensive. Therefore, only purchase it when:\n* It is ranked high in the Gear Priority Table\n* It is something you can't easily craft or get from a chest\n* You can spare the gold\n::::\n::::column\n## Store #3: Keith\n:::xs-img\n![Image](https://i.imgur.com/c6sYAZq.png)\n:::\n**Currency:** Holistone Coins\\\n**Earned By:** Killing World Enemies\\\n**Spend On:** Soulstones, Overleveled Gear\\\n**Notes:** New purchasable items unlock only from spending additional coins in the store. So only buy EXP manuals when necessary to unlock more Soulstones or Gear.\n::::\n:::::\n\n# Affinity\nHero Affinity is a minor mechanic which provides small rewards for reaching each of 2-3 realistic thresholds for each hero. Affinity is gained passively by heroes as an additional reward when completing battles with them. Besides this, Affinity is boosted by using campaign ‘gatherable’ items on your heroes in the Affinity section of their hero page. Because your main heroes will steadily build affinity through being used often, start at the very bottom of your roster when applying gatherables, always with Chippy and Hammie. At the beginning of the game, aim simply to reach the 100 Affinity mark for each hero by applying a single gatherable, providing a 50 Diamond reward.\n::::centered-content\n:::sm-img\n![Image](https://i.imgur.com/U0cvnJk.png)\n:::\n::::\nAs you enter into midgame later on, you will push your heroes to 700 and 1300 affinity, earning 50 diamonds and 1 invite letter each, respectively. Trying to distribute gatherables evenly to get all heroes to the 700 threshold is a waste of time for only 50 diamonds each, so it is recommended to simply push heroes one by one straight from 100 to 1300 once you're able.\n\n*Note: Affinity items purchased in the Friendship store are faction-specific, and grant +170 affinity to heroes from their corresponding faction, rather than +110 to other heroes.*\n\n# Looking Ahead/Midgame Considerations\n## Stargazing\nThe Stargazing Station is not unlocked until at least 400 invite letters have been consumed. Especially for f2p players, this usually takes a few weeks of play. Fortunately Stargazing is a very set-and-forget mechanic. After choosing a target Hypogean or Celestial hero, (virtually all players will want to go Reiner first) you will simply save up Dolly Tickets and purchase Stargazing Crystals whenever available in the Recruitment (and Guild) store.\n\nF2p players will have limited access to Crystals, as the Emporium is generally their only opportunity, and with a 3.25% chance to pull your target hero, Stargazing should be viewed as a slow process of working the guaranteed pull counter down from 40. Of course, luck will affect this for some players, and there are small chances in the pool to get huge amounts of Diamonds, as well as small amounts of Blue (Tidal) or Gold (Temporal) Essence.\n\nBecause of their extreme scarcity, for f2p players, having God heroes is not something that should ever be expected, and through the course of the game you will likely have only one ascended to a usable tier (Mythic+ or Supreme+).\n\n::::centered-content\n:::md-img\n![Image](https://i.imgur.com/gcMBDH9.png)\n:::\n::::\n\n## Primal Lords\nWorld bosses (Primal Lords) appear at specific locations on the map throughout the course of the game. The first appears in Chapter 2 at Dark Forest 5, 7 days after the launch of each server. The second appears in Chapter 3 at Vaduso Mountain 5, 14 days after the launch of each server. Each attack on these world bosses yields gear and Dust scaled to the amount of damage inflicted. Upon their death, each boss awards the entire server with gear, and a large amount of Dust, Epic Soulstones, Invite Letters, and Diamonds based on how long it took the server to defeat it. For those players who ranked in the top 200 on damage, it also gives Red (Twilight) Essence.\n\n## EX / Exclusive Equipment\nAs players progress later into the game, they will start receiving Blue, Gold and Red Essence, known as Tidal, Temporal and Twilight Essence. These resources are relatively rare (increasingly so as they range from Blue to Red), and are used to upgrade Hero Focus at Mythic tier, and Exclusive Equipment at Mythic+. Upgrading a hero's Exclusive Equipment increases their base stats, secondary stats and unlocks skills (lvl 5, 10, 15).\n\nIt is generally recommended for players to wait to spend any gems above Blue until consulting our Benchmark Guide, since their availability is extremely limited and investing in the wrong heroes is one of the few serious misplays of late game.\n\n::::::two-column\n:::::column\n::::centered-content\n:::xs-img\n![Image](https://i.imgur.com/ve19Q3i.png)\n:::\n::::\n:::::\n:::::column\n::::centered-content\n:::sm-img\n![Image](https://i.imgur.com/QPYlLV3.png)\n:::\n::::\n:::::\n::::::\n\n# Spending Pitfalls & Optimizations\n:::centered-text\n_**What to invest in and what to avoid**_\n:::\n::::centered-content\n:::xl-img\n![Image](https://i.imgur.com/tH91Hd0.png)\n:::\n::::\nThere are a lot of spending options in AFK Journey, and it's easy to get overwhelmed. There are Special Offers, 'Gazettes', 'Growth Bundles', 'Limited Bundles', 'Permanent Bundles', and - frankly an excessive amount of - 'Pop Up' bundles that boldly claim to give you 'Free Rewards' after purchase. All of this is designed to overwhelm and confuse you. Therefore, Analytica's main goal is to recommend strong, optimal spending decisions that protect your wallet and enhance your playing experience.\n\nAt the most baseline 'spending tier', we recommend the 'Noble Path' $10 bundle as your first and most valuable purchase. Not only does this bundle yield Epic Letters, Acorns, and Soulstones, but more importantly, this bundle contains dust and experience that ultimately raises your maximum level threshold. No other bundle yields experience in this way, so missing this bundle essentially puts you at a severe disadvantage if you are interested in maintaining high ranks on the leaderboard.\n\nThe next two bundles of highest yield are the 'Classic Gazette' and 'Premium Gazette'. The first yields daily Diamonds, which is useful for keeping up with Recruitment and Fast Rewards. The second focuses on Epic Letters for Epic Hero Recruitment. In conjunction, these two Gazettes provide you with a solid economic foundation to smoothly progress through the game with less headache.\n\nEvery season there is a new Noble Path, and every season lasts 4 months. At $2.50 per month for the Noble Path, and $5 per month for the 'Classic Gazette', we believe that this is a solid investment towards an increase in 'acquisition of content'."
    },
    "tier list": {
      "details": "Who is the best in all of Esperia?",
      "content": "# This is a Tier List"
    },
    "spending": {
      "details": "How do you spend your money intelligently in Esperia?",
      "content": "# Spending Guide"
    }
  },
  "advanced": {
    "artifacts": {
      "details": "A simple guide detailing all of the artifacts and seasonal artifacts.",
      "content": "# Artifacts Guide\n\n| col a | col b |\n| - | - |\n| 1 | 2 |"
    },
    "ascension": {
      "details": "How does one ascend heroes to their highest tier in AFK Journey?",
      "content": "# Ascension Guide"
    },
    "equipment": {
      "details": "This guide is under construction.",
      "content": "# Equipment Guide"
    }
  }
}
